###################################################################

# Created by write_sdc on Fri Apr 28 20:19:18 2017

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 150000
set_load -pin_load 0.001 [get_ports {regacc_out[31]}]
set_load -pin_load 0.001 [get_ports {regacc_out[30]}]
set_load -pin_load 0.001 [get_ports {regacc_out[29]}]
set_load -pin_load 0.001 [get_ports {regacc_out[28]}]
set_load -pin_load 0.001 [get_ports {regacc_out[27]}]
set_load -pin_load 0.001 [get_ports {regacc_out[26]}]
set_load -pin_load 0.001 [get_ports {regacc_out[25]}]
set_load -pin_load 0.001 [get_ports {regacc_out[24]}]
set_load -pin_load 0.001 [get_ports {regacc_out[23]}]
set_load -pin_load 0.001 [get_ports {regacc_out[22]}]
set_load -pin_load 0.001 [get_ports {regacc_out[21]}]
set_load -pin_load 0.001 [get_ports {regacc_out[20]}]
set_load -pin_load 0.001 [get_ports {regacc_out[19]}]
set_load -pin_load 0.001 [get_ports {regacc_out[18]}]
set_load -pin_load 0.001 [get_ports {regacc_out[17]}]
set_load -pin_load 0.001 [get_ports {regacc_out[16]}]
set_load -pin_load 0.001 [get_ports {regacc_out[15]}]
set_load -pin_load 0.001 [get_ports {regacc_out[14]}]
set_load -pin_load 0.001 [get_ports {regacc_out[13]}]
set_load -pin_load 0.001 [get_ports {regacc_out[12]}]
set_load -pin_load 0.001 [get_ports {regacc_out[11]}]
set_load -pin_load 0.001 [get_ports {regacc_out[10]}]
set_load -pin_load 0.001 [get_ports {regacc_out[9]}]
set_load -pin_load 0.001 [get_ports {regacc_out[8]}]
set_load -pin_load 0.001 [get_ports {regacc_out[7]}]
set_load -pin_load 0.001 [get_ports {regacc_out[6]}]
set_load -pin_load 0.001 [get_ports {regacc_out[5]}]
set_load -pin_load 0.001 [get_ports {regacc_out[4]}]
set_load -pin_load 0.001 [get_ports {regacc_out[3]}]
set_load -pin_load 0.001 [get_ports {regacc_out[2]}]
set_load -pin_load 0.001 [get_ports {regacc_out[1]}]
set_load -pin_load 0.001 [get_ports {regacc_out[0]}]
set_load -pin_load 0.001 [get_ports {state_out[8]}]
set_load -pin_load 0.001 [get_ports {state_out[7]}]
set_load -pin_load 0.001 [get_ports {state_out[6]}]
set_load -pin_load 0.001 [get_ports {state_out[5]}]
set_load -pin_load 0.001 [get_ports {state_out[4]}]
set_load -pin_load 0.001 [get_ports {state_out[3]}]
set_load -pin_load 0.001 [get_ports {state_out[2]}]
set_load -pin_load 0.001 [get_ports {state_out[1]}]
set_load -pin_load 0.001 [get_ports {state_out[0]}]
set_load -pin_load 0.001 [get_ports Coutadd]
set_load -pin_load 0.001 [get_ports Coutone]
set_load -pin_load 0.001 [get_ports Couttwo]
set_load -pin_load 0.001 [get_ports {m14_out[31]}]
set_load -pin_load 0.001 [get_ports {m14_out[30]}]
set_load -pin_load 0.001 [get_ports {m14_out[29]}]
set_load -pin_load 0.001 [get_ports {m14_out[28]}]
set_load -pin_load 0.001 [get_ports {m14_out[27]}]
set_load -pin_load 0.001 [get_ports {m14_out[26]}]
set_load -pin_load 0.001 [get_ports {m14_out[25]}]
set_load -pin_load 0.001 [get_ports {m14_out[24]}]
set_load -pin_load 0.001 [get_ports {m14_out[23]}]
set_load -pin_load 0.001 [get_ports {m14_out[22]}]
set_load -pin_load 0.001 [get_ports {m14_out[21]}]
set_load -pin_load 0.001 [get_ports {m14_out[20]}]
set_load -pin_load 0.001 [get_ports {m14_out[19]}]
set_load -pin_load 0.001 [get_ports {m14_out[18]}]
set_load -pin_load 0.001 [get_ports {m14_out[17]}]
set_load -pin_load 0.001 [get_ports {m14_out[16]}]
set_load -pin_load 0.001 [get_ports {m14_out[15]}]
set_load -pin_load 0.001 [get_ports {m14_out[14]}]
set_load -pin_load 0.001 [get_ports {m14_out[13]}]
set_load -pin_load 0.001 [get_ports {m14_out[12]}]
set_load -pin_load 0.001 [get_ports {m14_out[11]}]
set_load -pin_load 0.001 [get_ports {m14_out[10]}]
set_load -pin_load 0.001 [get_ports {m14_out[9]}]
set_load -pin_load 0.001 [get_ports {m14_out[8]}]
set_load -pin_load 0.001 [get_ports {m14_out[7]}]
set_load -pin_load 0.001 [get_ports {m14_out[6]}]
set_load -pin_load 0.001 [get_ports {m14_out[5]}]
set_load -pin_load 0.001 [get_ports {m14_out[4]}]
set_load -pin_load 0.001 [get_ports {m14_out[3]}]
set_load -pin_load 0.001 [get_ports {m14_out[2]}]
set_load -pin_load 0.001 [get_ports {m14_out[1]}]
set_load -pin_load 0.001 [get_ports {m14_out[0]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[31]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[30]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[29]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[28]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[27]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[26]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[25]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[24]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[23]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[22]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[21]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[20]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[19]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[18]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[17]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[16]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[15]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[14]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[13]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[12]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[11]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[10]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[9]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[8]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[7]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[6]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[5]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[4]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[3]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[2]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[1]}]
set_load -pin_load 0.001 [get_ports {alutwo_out[0]}]
set_load -pin_load 0.001 [get_ports {m17_out[31]}]
set_load -pin_load 0.001 [get_ports {m17_out[30]}]
set_load -pin_load 0.001 [get_ports {m17_out[29]}]
set_load -pin_load 0.001 [get_ports {m17_out[28]}]
set_load -pin_load 0.001 [get_ports {m17_out[27]}]
set_load -pin_load 0.001 [get_ports {m17_out[26]}]
set_load -pin_load 0.001 [get_ports {m17_out[25]}]
set_load -pin_load 0.001 [get_ports {m17_out[24]}]
set_load -pin_load 0.001 [get_ports {m17_out[23]}]
set_load -pin_load 0.001 [get_ports {m17_out[22]}]
set_load -pin_load 0.001 [get_ports {m17_out[21]}]
set_load -pin_load 0.001 [get_ports {m17_out[20]}]
set_load -pin_load 0.001 [get_ports {m17_out[19]}]
set_load -pin_load 0.001 [get_ports {m17_out[18]}]
set_load -pin_load 0.001 [get_ports {m17_out[17]}]
set_load -pin_load 0.001 [get_ports {m17_out[16]}]
set_load -pin_load 0.001 [get_ports {m17_out[15]}]
set_load -pin_load 0.001 [get_ports {m17_out[14]}]
set_load -pin_load 0.001 [get_ports {m17_out[13]}]
set_load -pin_load 0.001 [get_ports {m17_out[12]}]
set_load -pin_load 0.001 [get_ports {m17_out[11]}]
set_load -pin_load 0.001 [get_ports {m17_out[10]}]
set_load -pin_load 0.001 [get_ports {m17_out[9]}]
set_load -pin_load 0.001 [get_ports {m17_out[8]}]
set_load -pin_load 0.001 [get_ports {m17_out[7]}]
set_load -pin_load 0.001 [get_ports {m17_out[6]}]
set_load -pin_load 0.001 [get_ports {m17_out[5]}]
set_load -pin_load 0.001 [get_ports {m17_out[4]}]
set_load -pin_load 0.001 [get_ports {m17_out[3]}]
set_load -pin_load 0.001 [get_ports {m17_out[2]}]
set_load -pin_load 0.001 [get_ports {m17_out[1]}]
set_load -pin_load 0.001 [get_ports {m17_out[0]}]
set_load -pin_load 0.001 [get_ports {m18_out[31]}]
set_load -pin_load 0.001 [get_ports {m18_out[30]}]
set_load -pin_load 0.001 [get_ports {m18_out[29]}]
set_load -pin_load 0.001 [get_ports {m18_out[28]}]
set_load -pin_load 0.001 [get_ports {m18_out[27]}]
set_load -pin_load 0.001 [get_ports {m18_out[26]}]
set_load -pin_load 0.001 [get_ports {m18_out[25]}]
set_load -pin_load 0.001 [get_ports {m18_out[24]}]
set_load -pin_load 0.001 [get_ports {m18_out[23]}]
set_load -pin_load 0.001 [get_ports {m18_out[22]}]
set_load -pin_load 0.001 [get_ports {m18_out[21]}]
set_load -pin_load 0.001 [get_ports {m18_out[20]}]
set_load -pin_load 0.001 [get_ports {m18_out[19]}]
set_load -pin_load 0.001 [get_ports {m18_out[18]}]
set_load -pin_load 0.001 [get_ports {m18_out[17]}]
set_load -pin_load 0.001 [get_ports {m18_out[16]}]
set_load -pin_load 0.001 [get_ports {m18_out[15]}]
set_load -pin_load 0.001 [get_ports {m18_out[14]}]
set_load -pin_load 0.001 [get_ports {m18_out[13]}]
set_load -pin_load 0.001 [get_ports {m18_out[12]}]
set_load -pin_load 0.001 [get_ports {m18_out[11]}]
set_load -pin_load 0.001 [get_ports {m18_out[10]}]
set_load -pin_load 0.001 [get_ports {m18_out[9]}]
set_load -pin_load 0.001 [get_ports {m18_out[8]}]
set_load -pin_load 0.001 [get_ports {m18_out[7]}]
set_load -pin_load 0.001 [get_ports {m18_out[6]}]
set_load -pin_load 0.001 [get_ports {m18_out[5]}]
set_load -pin_load 0.001 [get_ports {m18_out[4]}]
set_load -pin_load 0.001 [get_ports {m18_out[3]}]
set_load -pin_load 0.001 [get_ports {m18_out[2]}]
set_load -pin_load 0.001 [get_ports {m18_out[1]}]
set_load -pin_load 0.001 [get_ports {m18_out[0]}]
set_load -pin_load 0.001 [get_ports {srmq_out[63]}]
set_load -pin_load 0.001 [get_ports {srmq_out[62]}]
set_load -pin_load 0.001 [get_ports {srmq_out[61]}]
set_load -pin_load 0.001 [get_ports {srmq_out[60]}]
set_load -pin_load 0.001 [get_ports {srmq_out[59]}]
set_load -pin_load 0.001 [get_ports {srmq_out[58]}]
set_load -pin_load 0.001 [get_ports {srmq_out[57]}]
set_load -pin_load 0.001 [get_ports {srmq_out[56]}]
set_load -pin_load 0.001 [get_ports {srmq_out[55]}]
set_load -pin_load 0.001 [get_ports {srmq_out[54]}]
set_load -pin_load 0.001 [get_ports {srmq_out[53]}]
set_load -pin_load 0.001 [get_ports {srmq_out[52]}]
set_load -pin_load 0.001 [get_ports {srmq_out[51]}]
set_load -pin_load 0.001 [get_ports {srmq_out[50]}]
set_load -pin_load 0.001 [get_ports {srmq_out[49]}]
set_load -pin_load 0.001 [get_ports {srmq_out[48]}]
set_load -pin_load 0.001 [get_ports {srmq_out[47]}]
set_load -pin_load 0.001 [get_ports {srmq_out[46]}]
set_load -pin_load 0.001 [get_ports {srmq_out[45]}]
set_load -pin_load 0.001 [get_ports {srmq_out[44]}]
set_load -pin_load 0.001 [get_ports {srmq_out[43]}]
set_load -pin_load 0.001 [get_ports {srmq_out[42]}]
set_load -pin_load 0.001 [get_ports {srmq_out[41]}]
set_load -pin_load 0.001 [get_ports {srmq_out[40]}]
set_load -pin_load 0.001 [get_ports {srmq_out[39]}]
set_load -pin_load 0.001 [get_ports {srmq_out[38]}]
set_load -pin_load 0.001 [get_ports {srmq_out[37]}]
set_load -pin_load 0.001 [get_ports {srmq_out[36]}]
set_load -pin_load 0.001 [get_ports {srmq_out[35]}]
set_load -pin_load 0.001 [get_ports {srmq_out[34]}]
set_load -pin_load 0.001 [get_ports {srmq_out[33]}]
set_load -pin_load 0.001 [get_ports {srmq_out[32]}]
set_load -pin_load 0.001 [get_ports {srmq_out[31]}]
set_load -pin_load 0.001 [get_ports {srmq_out[30]}]
set_load -pin_load 0.001 [get_ports {srmq_out[29]}]
set_load -pin_load 0.001 [get_ports {srmq_out[28]}]
set_load -pin_load 0.001 [get_ports {srmq_out[27]}]
set_load -pin_load 0.001 [get_ports {srmq_out[26]}]
set_load -pin_load 0.001 [get_ports {srmq_out[25]}]
set_load -pin_load 0.001 [get_ports {srmq_out[24]}]
set_load -pin_load 0.001 [get_ports {srmq_out[23]}]
set_load -pin_load 0.001 [get_ports {srmq_out[22]}]
set_load -pin_load 0.001 [get_ports {srmq_out[21]}]
set_load -pin_load 0.001 [get_ports {srmq_out[20]}]
set_load -pin_load 0.001 [get_ports {srmq_out[19]}]
set_load -pin_load 0.001 [get_ports {srmq_out[18]}]
set_load -pin_load 0.001 [get_ports {srmq_out[17]}]
set_load -pin_load 0.001 [get_ports {srmq_out[16]}]
set_load -pin_load 0.001 [get_ports {srmq_out[15]}]
set_load -pin_load 0.001 [get_ports {srmq_out[14]}]
set_load -pin_load 0.001 [get_ports {srmq_out[13]}]
set_load -pin_load 0.001 [get_ports {srmq_out[12]}]
set_load -pin_load 0.001 [get_ports {srmq_out[11]}]
set_load -pin_load 0.001 [get_ports {srmq_out[10]}]
set_load -pin_load 0.001 [get_ports {srmq_out[9]}]
set_load -pin_load 0.001 [get_ports {srmq_out[8]}]
set_load -pin_load 0.001 [get_ports {srmq_out[7]}]
set_load -pin_load 0.001 [get_ports {srmq_out[6]}]
set_load -pin_load 0.001 [get_ports {srmq_out[5]}]
set_load -pin_load 0.001 [get_ports {srmq_out[4]}]
set_load -pin_load 0.001 [get_ports {srmq_out[3]}]
set_load -pin_load 0.001 [get_ports {srmq_out[2]}]
set_load -pin_load 0.001 [get_ports {srmq_out[1]}]
set_load -pin_load 0.001 [get_ports {srmq_out[0]}]
set_load -pin_load 0.001 [get_ports {regec_out[31]}]
set_load -pin_load 0.001 [get_ports {regec_out[30]}]
set_load -pin_load 0.001 [get_ports {regec_out[29]}]
set_load -pin_load 0.001 [get_ports {regec_out[28]}]
set_load -pin_load 0.001 [get_ports {regec_out[27]}]
set_load -pin_load 0.001 [get_ports {regec_out[26]}]
set_load -pin_load 0.001 [get_ports {regec_out[25]}]
set_load -pin_load 0.001 [get_ports {regec_out[24]}]
set_load -pin_load 0.001 [get_ports {regec_out[23]}]
set_load -pin_load 0.001 [get_ports {regec_out[22]}]
set_load -pin_load 0.001 [get_ports {regec_out[21]}]
set_load -pin_load 0.001 [get_ports {regec_out[20]}]
set_load -pin_load 0.001 [get_ports {regec_out[19]}]
set_load -pin_load 0.001 [get_ports {regec_out[18]}]
set_load -pin_load 0.001 [get_ports {regec_out[17]}]
set_load -pin_load 0.001 [get_ports {regec_out[16]}]
set_load -pin_load 0.001 [get_ports {regec_out[15]}]
set_load -pin_load 0.001 [get_ports {regec_out[14]}]
set_load -pin_load 0.001 [get_ports {regec_out[13]}]
set_load -pin_load 0.001 [get_ports {regec_out[12]}]
set_load -pin_load 0.001 [get_ports {regec_out[11]}]
set_load -pin_load 0.001 [get_ports {regec_out[10]}]
set_load -pin_load 0.001 [get_ports {regec_out[9]}]
set_load -pin_load 0.001 [get_ports {regec_out[8]}]
set_load -pin_load 0.001 [get_ports {regec_out[7]}]
set_load -pin_load 0.001 [get_ports {regec_out[6]}]
set_load -pin_load 0.001 [get_ports {regec_out[5]}]
set_load -pin_load 0.001 [get_ports {regec_out[4]}]
set_load -pin_load 0.001 [get_ports {regec_out[3]}]
set_load -pin_load 0.001 [get_ports {regec_out[2]}]
set_load -pin_load 0.001 [get_ports {regec_out[1]}]
set_load -pin_load 0.001 [get_ports {regec_out[0]}]
set_load -pin_load 0.001 [get_ports {regeb_out[31]}]
set_load -pin_load 0.001 [get_ports {regeb_out[30]}]
set_load -pin_load 0.001 [get_ports {regeb_out[29]}]
set_load -pin_load 0.001 [get_ports {regeb_out[28]}]
set_load -pin_load 0.001 [get_ports {regeb_out[27]}]
set_load -pin_load 0.001 [get_ports {regeb_out[26]}]
set_load -pin_load 0.001 [get_ports {regeb_out[25]}]
set_load -pin_load 0.001 [get_ports {regeb_out[24]}]
set_load -pin_load 0.001 [get_ports {regeb_out[23]}]
set_load -pin_load 0.001 [get_ports {regeb_out[22]}]
set_load -pin_load 0.001 [get_ports {regeb_out[21]}]
set_load -pin_load 0.001 [get_ports {regeb_out[20]}]
set_load -pin_load 0.001 [get_ports {regeb_out[19]}]
set_load -pin_load 0.001 [get_ports {regeb_out[18]}]
set_load -pin_load 0.001 [get_ports {regeb_out[17]}]
set_load -pin_load 0.001 [get_ports {regeb_out[16]}]
set_load -pin_load 0.001 [get_ports {regeb_out[15]}]
set_load -pin_load 0.001 [get_ports {regeb_out[14]}]
set_load -pin_load 0.001 [get_ports {regeb_out[13]}]
set_load -pin_load 0.001 [get_ports {regeb_out[12]}]
set_load -pin_load 0.001 [get_ports {regeb_out[11]}]
set_load -pin_load 0.001 [get_ports {regeb_out[10]}]
set_load -pin_load 0.001 [get_ports {regeb_out[9]}]
set_load -pin_load 0.001 [get_ports {regeb_out[8]}]
set_load -pin_load 0.001 [get_ports {regeb_out[7]}]
set_load -pin_load 0.001 [get_ports {regeb_out[6]}]
set_load -pin_load 0.001 [get_ports {regeb_out[5]}]
set_load -pin_load 0.001 [get_ports {regeb_out[4]}]
set_load -pin_load 0.001 [get_ports {regeb_out[3]}]
set_load -pin_load 0.001 [get_ports {regeb_out[2]}]
set_load -pin_load 0.001 [get_ports {regeb_out[1]}]
set_load -pin_load 0.001 [get_ports {regeb_out[0]}]
set_load -pin_load 0.001 [get_ports {rf_aout[31]}]
set_load -pin_load 0.001 [get_ports {rf_aout[30]}]
set_load -pin_load 0.001 [get_ports {rf_aout[29]}]
set_load -pin_load 0.001 [get_ports {rf_aout[28]}]
set_load -pin_load 0.001 [get_ports {rf_aout[27]}]
set_load -pin_load 0.001 [get_ports {rf_aout[26]}]
set_load -pin_load 0.001 [get_ports {rf_aout[25]}]
set_load -pin_load 0.001 [get_ports {rf_aout[24]}]
set_load -pin_load 0.001 [get_ports {rf_aout[23]}]
set_load -pin_load 0.001 [get_ports {rf_aout[22]}]
set_load -pin_load 0.001 [get_ports {rf_aout[21]}]
set_load -pin_load 0.001 [get_ports {rf_aout[20]}]
set_load -pin_load 0.001 [get_ports {rf_aout[19]}]
set_load -pin_load 0.001 [get_ports {rf_aout[18]}]
set_load -pin_load 0.001 [get_ports {rf_aout[17]}]
set_load -pin_load 0.001 [get_ports {rf_aout[16]}]
set_load -pin_load 0.001 [get_ports {rf_aout[15]}]
set_load -pin_load 0.001 [get_ports {rf_aout[14]}]
set_load -pin_load 0.001 [get_ports {rf_aout[13]}]
set_load -pin_load 0.001 [get_ports {rf_aout[12]}]
set_load -pin_load 0.001 [get_ports {rf_aout[11]}]
set_load -pin_load 0.001 [get_ports {rf_aout[10]}]
set_load -pin_load 0.001 [get_ports {rf_aout[9]}]
set_load -pin_load 0.001 [get_ports {rf_aout[8]}]
set_load -pin_load 0.001 [get_ports {rf_aout[7]}]
set_load -pin_load 0.001 [get_ports {rf_aout[6]}]
set_load -pin_load 0.001 [get_ports {rf_aout[5]}]
set_load -pin_load 0.001 [get_ports {rf_aout[4]}]
set_load -pin_load 0.001 [get_ports {rf_aout[3]}]
set_load -pin_load 0.001 [get_ports {rf_aout[2]}]
set_load -pin_load 0.001 [get_ports {rf_aout[1]}]
set_load -pin_load 0.001 [get_ports {rf_aout[0]}]
set_load -pin_load 0.001 [get_ports {regi_out[5]}]
set_load -pin_load 0.001 [get_ports {regi_out[4]}]
set_load -pin_load 0.001 [get_ports {regi_out[3]}]
set_load -pin_load 0.001 [get_ports {regi_out[2]}]
set_load -pin_load 0.001 [get_ports {regi_out[1]}]
set_load -pin_load 0.001 [get_ports {regi_out[0]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[31]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[30]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[29]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[28]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[27]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[26]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[25]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[24]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[23]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[22]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[21]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[20]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[19]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[18]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[17]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[16]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[15]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[14]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[13]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[12]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[11]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[10]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[9]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[8]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[7]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[6]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[5]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[4]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[3]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[2]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[1]}]
set_load -pin_load 0.001 [get_ports {regcurrterm_out[0]}]
set_load -pin_load 0.001 [get_ports {regsum_out[31]}]
set_load -pin_load 0.001 [get_ports {regsum_out[30]}]
set_load -pin_load 0.001 [get_ports {regsum_out[29]}]
set_load -pin_load 0.001 [get_ports {regsum_out[28]}]
set_load -pin_load 0.001 [get_ports {regsum_out[27]}]
set_load -pin_load 0.001 [get_ports {regsum_out[26]}]
set_load -pin_load 0.001 [get_ports {regsum_out[25]}]
set_load -pin_load 0.001 [get_ports {regsum_out[24]}]
set_load -pin_load 0.001 [get_ports {regsum_out[23]}]
set_load -pin_load 0.001 [get_ports {regsum_out[22]}]
set_load -pin_load 0.001 [get_ports {regsum_out[21]}]
set_load -pin_load 0.001 [get_ports {regsum_out[20]}]
set_load -pin_load 0.001 [get_ports {regsum_out[19]}]
set_load -pin_load 0.001 [get_ports {regsum_out[18]}]
set_load -pin_load 0.001 [get_ports {regsum_out[17]}]
set_load -pin_load 0.001 [get_ports {regsum_out[16]}]
set_load -pin_load 0.001 [get_ports {regsum_out[15]}]
set_load -pin_load 0.001 [get_ports {regsum_out[14]}]
set_load -pin_load 0.001 [get_ports {regsum_out[13]}]
set_load -pin_load 0.001 [get_ports {regsum_out[12]}]
set_load -pin_load 0.001 [get_ports {regsum_out[11]}]
set_load -pin_load 0.001 [get_ports {regsum_out[10]}]
set_load -pin_load 0.001 [get_ports {regsum_out[9]}]
set_load -pin_load 0.001 [get_ports {regsum_out[8]}]
set_load -pin_load 0.001 [get_ports {regsum_out[7]}]
set_load -pin_load 0.001 [get_ports {regsum_out[6]}]
set_load -pin_load 0.001 [get_ports {regsum_out[5]}]
set_load -pin_load 0.001 [get_ports {regsum_out[4]}]
set_load -pin_load 0.001 [get_ports {regsum_out[3]}]
set_load -pin_load 0.001 [get_ports {regsum_out[2]}]
set_load -pin_load 0.001 [get_ports {regsum_out[1]}]
set_load -pin_load 0.001 [get_ports {regsum_out[0]}]
set_load -pin_load 0.001 [get_ports {srmt_out[31]}]
set_load -pin_load 0.001 [get_ports {srmt_out[30]}]
set_load -pin_load 0.001 [get_ports {srmt_out[29]}]
set_load -pin_load 0.001 [get_ports {srmt_out[28]}]
set_load -pin_load 0.001 [get_ports {srmt_out[27]}]
set_load -pin_load 0.001 [get_ports {srmt_out[26]}]
set_load -pin_load 0.001 [get_ports {srmt_out[25]}]
set_load -pin_load 0.001 [get_ports {srmt_out[24]}]
set_load -pin_load 0.001 [get_ports {srmt_out[23]}]
set_load -pin_load 0.001 [get_ports {srmt_out[22]}]
set_load -pin_load 0.001 [get_ports {srmt_out[21]}]
set_load -pin_load 0.001 [get_ports {srmt_out[20]}]
set_load -pin_load 0.001 [get_ports {srmt_out[19]}]
set_load -pin_load 0.001 [get_ports {srmt_out[18]}]
set_load -pin_load 0.001 [get_ports {srmt_out[17]}]
set_load -pin_load 0.001 [get_ports {srmt_out[16]}]
set_load -pin_load 0.001 [get_ports {srmt_out[15]}]
set_load -pin_load 0.001 [get_ports {srmt_out[14]}]
set_load -pin_load 0.001 [get_ports {srmt_out[13]}]
set_load -pin_load 0.001 [get_ports {srmt_out[12]}]
set_load -pin_load 0.001 [get_ports {srmt_out[11]}]
set_load -pin_load 0.001 [get_ports {srmt_out[10]}]
set_load -pin_load 0.001 [get_ports {srmt_out[9]}]
set_load -pin_load 0.001 [get_ports {srmt_out[8]}]
set_load -pin_load 0.001 [get_ports {srmt_out[7]}]
set_load -pin_load 0.001 [get_ports {srmt_out[6]}]
set_load -pin_load 0.001 [get_ports {srmt_out[5]}]
set_load -pin_load 0.001 [get_ports {srmt_out[4]}]
set_load -pin_load 0.001 [get_ports {srmt_out[3]}]
set_load -pin_load 0.001 [get_ports {srmt_out[2]}]
set_load -pin_load 0.001 [get_ports {srmt_out[1]}]
set_load -pin_load 0.001 [get_ports {srmt_out[0]}]
set_load -pin_load 0.001 [get_ports {regms_out[31]}]
set_load -pin_load 0.001 [get_ports {regms_out[30]}]
set_load -pin_load 0.001 [get_ports {regms_out[29]}]
set_load -pin_load 0.001 [get_ports {regms_out[28]}]
set_load -pin_load 0.001 [get_ports {regms_out[27]}]
set_load -pin_load 0.001 [get_ports {regms_out[26]}]
set_load -pin_load 0.001 [get_ports {regms_out[25]}]
set_load -pin_load 0.001 [get_ports {regms_out[24]}]
set_load -pin_load 0.001 [get_ports {regms_out[23]}]
set_load -pin_load 0.001 [get_ports {regms_out[22]}]
set_load -pin_load 0.001 [get_ports {regms_out[21]}]
set_load -pin_load 0.001 [get_ports {regms_out[20]}]
set_load -pin_load 0.001 [get_ports {regms_out[19]}]
set_load -pin_load 0.001 [get_ports {regms_out[18]}]
set_load -pin_load 0.001 [get_ports {regms_out[17]}]
set_load -pin_load 0.001 [get_ports {regms_out[16]}]
set_load -pin_load 0.001 [get_ports {regms_out[15]}]
set_load -pin_load 0.001 [get_ports {regms_out[14]}]
set_load -pin_load 0.001 [get_ports {regms_out[13]}]
set_load -pin_load 0.001 [get_ports {regms_out[12]}]
set_load -pin_load 0.001 [get_ports {regms_out[11]}]
set_load -pin_load 0.001 [get_ports {regms_out[10]}]
set_load -pin_load 0.001 [get_ports {regms_out[9]}]
set_load -pin_load 0.001 [get_ports {regms_out[8]}]
set_load -pin_load 0.001 [get_ports {regms_out[7]}]
set_load -pin_load 0.001 [get_ports {regms_out[6]}]
set_load -pin_load 0.001 [get_ports {regms_out[5]}]
set_load -pin_load 0.001 [get_ports {regms_out[4]}]
set_load -pin_load 0.001 [get_ports {regms_out[3]}]
set_load -pin_load 0.001 [get_ports {regms_out[2]}]
set_load -pin_load 0.001 [get_ports {regms_out[1]}]
set_load -pin_load 0.001 [get_ports {regms_out[0]}]
set_load -pin_load 0.001 [get_ports {reges_out[31]}]
set_load -pin_load 0.001 [get_ports {reges_out[30]}]
set_load -pin_load 0.001 [get_ports {reges_out[29]}]
set_load -pin_load 0.001 [get_ports {reges_out[28]}]
set_load -pin_load 0.001 [get_ports {reges_out[27]}]
set_load -pin_load 0.001 [get_ports {reges_out[26]}]
set_load -pin_load 0.001 [get_ports {reges_out[25]}]
set_load -pin_load 0.001 [get_ports {reges_out[24]}]
set_load -pin_load 0.001 [get_ports {reges_out[23]}]
set_load -pin_load 0.001 [get_ports {reges_out[22]}]
set_load -pin_load 0.001 [get_ports {reges_out[21]}]
set_load -pin_load 0.001 [get_ports {reges_out[20]}]
set_load -pin_load 0.001 [get_ports {reges_out[19]}]
set_load -pin_load 0.001 [get_ports {reges_out[18]}]
set_load -pin_load 0.001 [get_ports {reges_out[17]}]
set_load -pin_load 0.001 [get_ports {reges_out[16]}]
set_load -pin_load 0.001 [get_ports {reges_out[15]}]
set_load -pin_load 0.001 [get_ports {reges_out[14]}]
set_load -pin_load 0.001 [get_ports {reges_out[13]}]
set_load -pin_load 0.001 [get_ports {reges_out[12]}]
set_load -pin_load 0.001 [get_ports {reges_out[11]}]
set_load -pin_load 0.001 [get_ports {reges_out[10]}]
set_load -pin_load 0.001 [get_ports {reges_out[9]}]
set_load -pin_load 0.001 [get_ports {reges_out[8]}]
set_load -pin_load 0.001 [get_ports {reges_out[7]}]
set_load -pin_load 0.001 [get_ports {reges_out[6]}]
set_load -pin_load 0.001 [get_ports {reges_out[5]}]
set_load -pin_load 0.001 [get_ports {reges_out[4]}]
set_load -pin_load 0.001 [get_ports {reges_out[3]}]
set_load -pin_load 0.001 [get_ports {reges_out[2]}]
set_load -pin_load 0.001 [get_ports {reges_out[1]}]
set_load -pin_load 0.001 [get_ports {reges_out[0]}]
set_load -pin_load 0.001 [get_ports {reget_out[31]}]
set_load -pin_load 0.001 [get_ports {reget_out[30]}]
set_load -pin_load 0.001 [get_ports {reget_out[29]}]
set_load -pin_load 0.001 [get_ports {reget_out[28]}]
set_load -pin_load 0.001 [get_ports {reget_out[27]}]
set_load -pin_load 0.001 [get_ports {reget_out[26]}]
set_load -pin_load 0.001 [get_ports {reget_out[25]}]
set_load -pin_load 0.001 [get_ports {reget_out[24]}]
set_load -pin_load 0.001 [get_ports {reget_out[23]}]
set_load -pin_load 0.001 [get_ports {reget_out[22]}]
set_load -pin_load 0.001 [get_ports {reget_out[21]}]
set_load -pin_load 0.001 [get_ports {reget_out[20]}]
set_load -pin_load 0.001 [get_ports {reget_out[19]}]
set_load -pin_load 0.001 [get_ports {reget_out[18]}]
set_load -pin_load 0.001 [get_ports {reget_out[17]}]
set_load -pin_load 0.001 [get_ports {reget_out[16]}]
set_load -pin_load 0.001 [get_ports {reget_out[15]}]
set_load -pin_load 0.001 [get_ports {reget_out[14]}]
set_load -pin_load 0.001 [get_ports {reget_out[13]}]
set_load -pin_load 0.001 [get_ports {reget_out[12]}]
set_load -pin_load 0.001 [get_ports {reget_out[11]}]
set_load -pin_load 0.001 [get_ports {reget_out[10]}]
set_load -pin_load 0.001 [get_ports {reget_out[9]}]
set_load -pin_load 0.001 [get_ports {reget_out[8]}]
set_load -pin_load 0.001 [get_ports {reget_out[7]}]
set_load -pin_load 0.001 [get_ports {reget_out[6]}]
set_load -pin_load 0.001 [get_ports {reget_out[5]}]
set_load -pin_load 0.001 [get_ports {reget_out[4]}]
set_load -pin_load 0.001 [get_ports {reget_out[3]}]
set_load -pin_load 0.001 [get_ports {reget_out[2]}]
set_load -pin_load 0.001 [get_ports {reget_out[1]}]
set_load -pin_load 0.001 [get_ports {reget_out[0]}]
set_load -pin_load 0.001 [get_ports regss0_out]
set_load -pin_load 0.001 [get_ports {reges0_out[31]}]
set_load -pin_load 0.001 [get_ports {reges0_out[30]}]
set_load -pin_load 0.001 [get_ports {reges0_out[29]}]
set_load -pin_load 0.001 [get_ports {reges0_out[28]}]
set_load -pin_load 0.001 [get_ports {reges0_out[27]}]
set_load -pin_load 0.001 [get_ports {reges0_out[26]}]
set_load -pin_load 0.001 [get_ports {reges0_out[25]}]
set_load -pin_load 0.001 [get_ports {reges0_out[24]}]
set_load -pin_load 0.001 [get_ports {reges0_out[23]}]
set_load -pin_load 0.001 [get_ports {reges0_out[22]}]
set_load -pin_load 0.001 [get_ports {reges0_out[21]}]
set_load -pin_load 0.001 [get_ports {reges0_out[20]}]
set_load -pin_load 0.001 [get_ports {reges0_out[19]}]
set_load -pin_load 0.001 [get_ports {reges0_out[18]}]
set_load -pin_load 0.001 [get_ports {reges0_out[17]}]
set_load -pin_load 0.001 [get_ports {reges0_out[16]}]
set_load -pin_load 0.001 [get_ports {reges0_out[15]}]
set_load -pin_load 0.001 [get_ports {reges0_out[14]}]
set_load -pin_load 0.001 [get_ports {reges0_out[13]}]
set_load -pin_load 0.001 [get_ports {reges0_out[12]}]
set_load -pin_load 0.001 [get_ports {reges0_out[11]}]
set_load -pin_load 0.001 [get_ports {reges0_out[10]}]
set_load -pin_load 0.001 [get_ports {reges0_out[9]}]
set_load -pin_load 0.001 [get_ports {reges0_out[8]}]
set_load -pin_load 0.001 [get_ports {reges0_out[7]}]
set_load -pin_load 0.001 [get_ports {reges0_out[6]}]
set_load -pin_load 0.001 [get_ports {reges0_out[5]}]
set_load -pin_load 0.001 [get_ports {reges0_out[4]}]
set_load -pin_load 0.001 [get_ports {reges0_out[3]}]
set_load -pin_load 0.001 [get_ports {reges0_out[2]}]
set_load -pin_load 0.001 [get_ports {reges0_out[1]}]
set_load -pin_load 0.001 [get_ports {reges0_out[0]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[63]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[62]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[61]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[60]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[59]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[58]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[57]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[56]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[55]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[54]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[53]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[52]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[51]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[50]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[49]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[48]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[47]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[46]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[45]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[44]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[43]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[42]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[41]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[40]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[39]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[38]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[37]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[36]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[35]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[34]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[33]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[32]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[31]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[30]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[29]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[28]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[27]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[26]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[25]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[24]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[23]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[22]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[21]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[20]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[19]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[18]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[17]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[16]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[15]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[14]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[13]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[12]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[11]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[10]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[9]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[8]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[7]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[6]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[5]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[4]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[3]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[2]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[1]}]
set_load -pin_load 0.001 [get_ports {ssrms0_out[0]}]
set_load -pin_load 0.001 [get_ports {aluone_out[31]}]
set_load -pin_load 0.001 [get_ports {aluone_out[30]}]
set_load -pin_load 0.001 [get_ports {aluone_out[29]}]
set_load -pin_load 0.001 [get_ports {aluone_out[28]}]
set_load -pin_load 0.001 [get_ports {aluone_out[27]}]
set_load -pin_load 0.001 [get_ports {aluone_out[26]}]
set_load -pin_load 0.001 [get_ports {aluone_out[25]}]
set_load -pin_load 0.001 [get_ports {aluone_out[24]}]
set_load -pin_load 0.001 [get_ports {aluone_out[23]}]
set_load -pin_load 0.001 [get_ports {aluone_out[22]}]
set_load -pin_load 0.001 [get_ports {aluone_out[21]}]
set_load -pin_load 0.001 [get_ports {aluone_out[20]}]
set_load -pin_load 0.001 [get_ports {aluone_out[19]}]
set_load -pin_load 0.001 [get_ports {aluone_out[18]}]
set_load -pin_load 0.001 [get_ports {aluone_out[17]}]
set_load -pin_load 0.001 [get_ports {aluone_out[16]}]
set_load -pin_load 0.001 [get_ports {aluone_out[15]}]
set_load -pin_load 0.001 [get_ports {aluone_out[14]}]
set_load -pin_load 0.001 [get_ports {aluone_out[13]}]
set_load -pin_load 0.001 [get_ports {aluone_out[12]}]
set_load -pin_load 0.001 [get_ports {aluone_out[11]}]
set_load -pin_load 0.001 [get_ports {aluone_out[10]}]
set_load -pin_load 0.001 [get_ports {aluone_out[9]}]
set_load -pin_load 0.001 [get_ports {aluone_out[8]}]
set_load -pin_load 0.001 [get_ports {aluone_out[7]}]
set_load -pin_load 0.001 [get_ports {aluone_out[6]}]
set_load -pin_load 0.001 [get_ports {aluone_out[5]}]
set_load -pin_load 0.001 [get_ports {aluone_out[4]}]
set_load -pin_load 0.001 [get_ports {aluone_out[3]}]
set_load -pin_load 0.001 [get_ports {aluone_out[2]}]
set_load -pin_load 0.001 [get_ports {aluone_out[1]}]
set_load -pin_load 0.001 [get_ports {aluone_out[0]}]
set_load -pin_load 0.001 [get_ports {regreg_out[31]}]
set_load -pin_load 0.001 [get_ports {regreg_out[30]}]
set_load -pin_load 0.001 [get_ports {regreg_out[29]}]
set_load -pin_load 0.001 [get_ports {regreg_out[28]}]
set_load -pin_load 0.001 [get_ports {regreg_out[27]}]
set_load -pin_load 0.001 [get_ports {regreg_out[26]}]
set_load -pin_load 0.001 [get_ports {regreg_out[25]}]
set_load -pin_load 0.001 [get_ports {regreg_out[24]}]
set_load -pin_load 0.001 [get_ports {regreg_out[23]}]
set_load -pin_load 0.001 [get_ports {regreg_out[22]}]
set_load -pin_load 0.001 [get_ports {regreg_out[21]}]
set_load -pin_load 0.001 [get_ports {regreg_out[20]}]
set_load -pin_load 0.001 [get_ports {regreg_out[19]}]
set_load -pin_load 0.001 [get_ports {regreg_out[18]}]
set_load -pin_load 0.001 [get_ports {regreg_out[17]}]
set_load -pin_load 0.001 [get_ports {regreg_out[16]}]
set_load -pin_load 0.001 [get_ports {regreg_out[15]}]
set_load -pin_load 0.001 [get_ports {regreg_out[14]}]
set_load -pin_load 0.001 [get_ports {regreg_out[13]}]
set_load -pin_load 0.001 [get_ports {regreg_out[12]}]
set_load -pin_load 0.001 [get_ports {regreg_out[11]}]
set_load -pin_load 0.001 [get_ports {regreg_out[10]}]
set_load -pin_load 0.001 [get_ports {regreg_out[9]}]
set_load -pin_load 0.001 [get_ports {regreg_out[8]}]
set_load -pin_load 0.001 [get_ports {regreg_out[7]}]
set_load -pin_load 0.001 [get_ports {regreg_out[6]}]
set_load -pin_load 0.001 [get_ports {regreg_out[5]}]
set_load -pin_load 0.001 [get_ports {regreg_out[4]}]
set_load -pin_load 0.001 [get_ports {regreg_out[3]}]
set_load -pin_load 0.001 [get_ports {regreg_out[2]}]
set_load -pin_load 0.001 [get_ports {regreg_out[1]}]
set_load -pin_load 0.001 [get_ports {regreg_out[0]}]
set_load -pin_load 0.001 [get_ports {rege_out[31]}]
set_load -pin_load 0.001 [get_ports {rege_out[30]}]
set_load -pin_load 0.001 [get_ports {rege_out[29]}]
set_load -pin_load 0.001 [get_ports {rege_out[28]}]
set_load -pin_load 0.001 [get_ports {rege_out[27]}]
set_load -pin_load 0.001 [get_ports {rege_out[26]}]
set_load -pin_load 0.001 [get_ports {rege_out[25]}]
set_load -pin_load 0.001 [get_ports {rege_out[24]}]
set_load -pin_load 0.001 [get_ports {rege_out[23]}]
set_load -pin_load 0.001 [get_ports {rege_out[22]}]
set_load -pin_load 0.001 [get_ports {rege_out[21]}]
set_load -pin_load 0.001 [get_ports {rege_out[20]}]
set_load -pin_load 0.001 [get_ports {rege_out[19]}]
set_load -pin_load 0.001 [get_ports {rege_out[18]}]
set_load -pin_load 0.001 [get_ports {rege_out[17]}]
set_load -pin_load 0.001 [get_ports {rege_out[16]}]
set_load -pin_load 0.001 [get_ports {rege_out[15]}]
set_load -pin_load 0.001 [get_ports {rege_out[14]}]
set_load -pin_load 0.001 [get_ports {rege_out[13]}]
set_load -pin_load 0.001 [get_ports {rege_out[12]}]
set_load -pin_load 0.001 [get_ports {rege_out[11]}]
set_load -pin_load 0.001 [get_ports {rege_out[10]}]
set_load -pin_load 0.001 [get_ports {rege_out[9]}]
set_load -pin_load 0.001 [get_ports {rege_out[8]}]
set_load -pin_load 0.001 [get_ports {rege_out[7]}]
set_load -pin_load 0.001 [get_ports {rege_out[6]}]
set_load -pin_load 0.001 [get_ports {rege_out[5]}]
set_load -pin_load 0.001 [get_ports {rege_out[4]}]
set_load -pin_load 0.001 [get_ports {rege_out[3]}]
set_load -pin_load 0.001 [get_ports {rege_out[2]}]
set_load -pin_load 0.001 [get_ports {rege_out[1]}]
set_load -pin_load 0.001 [get_ports {rege_out[0]}]
create_clock [get_ports clk]  -period 120  -waveform {0 60}
set_clock_uncertainty 0  [get_clocks clk]
set_clock_transition -max -rise 0.5 [get_clocks clk]
set_clock_transition -max -fall 0.5 [get_clocks clk]
set_clock_transition -min -rise 0.5 [get_clocks clk]
set_clock_transition -min -fall 0.5 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports start]
set_input_delay -clock clk  0  [get_ports reset]
set_input_delay -clock clk  0  [get_ports {mode[2]}]
set_input_delay -clock clk  0  [get_ports {mode[1]}]
set_input_delay -clock clk  0  [get_ports {mode[0]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[31]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[30]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[29]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[28]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[27]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[26]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[25]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[24]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[23]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[22]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[21]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[20]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[19]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[18]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[17]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[16]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[15]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[14]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[13]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[12]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[11]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[10]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[9]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[8]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[7]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[6]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[5]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[4]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[3]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[2]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[1]}]
set_input_delay -clock clk  0  [get_ports {calculator_input[0]}]
set_input_delay -clock clk  0  [get_ports {n_input[31]}]
set_input_delay -clock clk  0  [get_ports {n_input[30]}]
set_input_delay -clock clk  0  [get_ports {n_input[29]}]
set_input_delay -clock clk  0  [get_ports {n_input[28]}]
set_input_delay -clock clk  0  [get_ports {n_input[27]}]
set_input_delay -clock clk  0  [get_ports {n_input[26]}]
set_input_delay -clock clk  0  [get_ports {n_input[25]}]
set_input_delay -clock clk  0  [get_ports {n_input[24]}]
set_input_delay -clock clk  0  [get_ports {n_input[23]}]
set_input_delay -clock clk  0  [get_ports {n_input[22]}]
set_input_delay -clock clk  0  [get_ports {n_input[21]}]
set_input_delay -clock clk  0  [get_ports {n_input[20]}]
set_input_delay -clock clk  0  [get_ports {n_input[19]}]
set_input_delay -clock clk  0  [get_ports {n_input[18]}]
set_input_delay -clock clk  0  [get_ports {n_input[17]}]
set_input_delay -clock clk  0  [get_ports {n_input[16]}]
set_input_delay -clock clk  0  [get_ports {n_input[15]}]
set_input_delay -clock clk  0  [get_ports {n_input[14]}]
set_input_delay -clock clk  0  [get_ports {n_input[13]}]
set_input_delay -clock clk  0  [get_ports {n_input[12]}]
set_input_delay -clock clk  0  [get_ports {n_input[11]}]
set_input_delay -clock clk  0  [get_ports {n_input[10]}]
set_input_delay -clock clk  0  [get_ports {n_input[9]}]
set_input_delay -clock clk  0  [get_ports {n_input[8]}]
set_input_delay -clock clk  0  [get_ports {n_input[7]}]
set_input_delay -clock clk  0  [get_ports {n_input[6]}]
set_input_delay -clock clk  0  [get_ports {n_input[5]}]
set_input_delay -clock clk  0  [get_ports {n_input[4]}]
set_input_delay -clock clk  0  [get_ports {n_input[3]}]
set_input_delay -clock clk  0  [get_ports {n_input[2]}]
set_input_delay -clock clk  0  [get_ports {n_input[1]}]
set_input_delay -clock clk  0  [get_ports {n_input[0]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[31]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[30]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[29]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[28]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[27]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[26]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[25]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[24]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[23]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[22]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[21]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[20]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[19]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[18]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[17]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[16]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[15]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[14]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[13]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[12]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[11]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[10]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[9]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[8]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[7]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[6]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[5]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[4]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[3]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[2]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[1]}]
set_output_delay -clock clk  3  [get_ports {regacc_out[0]}]
set_output_delay -clock clk  3  [get_ports {state_out[8]}]
set_output_delay -clock clk  3  [get_ports {state_out[7]}]
set_output_delay -clock clk  3  [get_ports {state_out[6]}]
set_output_delay -clock clk  3  [get_ports {state_out[5]}]
set_output_delay -clock clk  3  [get_ports {state_out[4]}]
set_output_delay -clock clk  3  [get_ports {state_out[3]}]
set_output_delay -clock clk  3  [get_ports {state_out[2]}]
set_output_delay -clock clk  3  [get_ports {state_out[1]}]
set_output_delay -clock clk  3  [get_ports {state_out[0]}]
set_output_delay -clock clk  3  [get_ports Coutadd]
set_output_delay -clock clk  3  [get_ports Coutone]
set_output_delay -clock clk  3  [get_ports Couttwo]
set_output_delay -clock clk  3  [get_ports {m14_out[31]}]
set_output_delay -clock clk  3  [get_ports {m14_out[30]}]
set_output_delay -clock clk  3  [get_ports {m14_out[29]}]
set_output_delay -clock clk  3  [get_ports {m14_out[28]}]
set_output_delay -clock clk  3  [get_ports {m14_out[27]}]
set_output_delay -clock clk  3  [get_ports {m14_out[26]}]
set_output_delay -clock clk  3  [get_ports {m14_out[25]}]
set_output_delay -clock clk  3  [get_ports {m14_out[24]}]
set_output_delay -clock clk  3  [get_ports {m14_out[23]}]
set_output_delay -clock clk  3  [get_ports {m14_out[22]}]
set_output_delay -clock clk  3  [get_ports {m14_out[21]}]
set_output_delay -clock clk  3  [get_ports {m14_out[20]}]
set_output_delay -clock clk  3  [get_ports {m14_out[19]}]
set_output_delay -clock clk  3  [get_ports {m14_out[18]}]
set_output_delay -clock clk  3  [get_ports {m14_out[17]}]
set_output_delay -clock clk  3  [get_ports {m14_out[16]}]
set_output_delay -clock clk  3  [get_ports {m14_out[15]}]
set_output_delay -clock clk  3  [get_ports {m14_out[14]}]
set_output_delay -clock clk  3  [get_ports {m14_out[13]}]
set_output_delay -clock clk  3  [get_ports {m14_out[12]}]
set_output_delay -clock clk  3  [get_ports {m14_out[11]}]
set_output_delay -clock clk  3  [get_ports {m14_out[10]}]
set_output_delay -clock clk  3  [get_ports {m14_out[9]}]
set_output_delay -clock clk  3  [get_ports {m14_out[8]}]
set_output_delay -clock clk  3  [get_ports {m14_out[7]}]
set_output_delay -clock clk  3  [get_ports {m14_out[6]}]
set_output_delay -clock clk  3  [get_ports {m14_out[5]}]
set_output_delay -clock clk  3  [get_ports {m14_out[4]}]
set_output_delay -clock clk  3  [get_ports {m14_out[3]}]
set_output_delay -clock clk  3  [get_ports {m14_out[2]}]
set_output_delay -clock clk  3  [get_ports {m14_out[1]}]
set_output_delay -clock clk  3  [get_ports {m14_out[0]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[31]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[30]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[29]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[28]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[27]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[26]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[25]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[24]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[23]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[22]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[21]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[20]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[19]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[18]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[17]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[16]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[15]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[14]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[13]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[12]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[11]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[10]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[9]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[8]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[7]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[6]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[5]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[4]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[3]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[2]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[1]}]
set_output_delay -clock clk  3  [get_ports {alutwo_out[0]}]
set_output_delay -clock clk  3  [get_ports {m17_out[31]}]
set_output_delay -clock clk  3  [get_ports {m17_out[30]}]
set_output_delay -clock clk  3  [get_ports {m17_out[29]}]
set_output_delay -clock clk  3  [get_ports {m17_out[28]}]
set_output_delay -clock clk  3  [get_ports {m17_out[27]}]
set_output_delay -clock clk  3  [get_ports {m17_out[26]}]
set_output_delay -clock clk  3  [get_ports {m17_out[25]}]
set_output_delay -clock clk  3  [get_ports {m17_out[24]}]
set_output_delay -clock clk  3  [get_ports {m17_out[23]}]
set_output_delay -clock clk  3  [get_ports {m17_out[22]}]
set_output_delay -clock clk  3  [get_ports {m17_out[21]}]
set_output_delay -clock clk  3  [get_ports {m17_out[20]}]
set_output_delay -clock clk  3  [get_ports {m17_out[19]}]
set_output_delay -clock clk  3  [get_ports {m17_out[18]}]
set_output_delay -clock clk  3  [get_ports {m17_out[17]}]
set_output_delay -clock clk  3  [get_ports {m17_out[16]}]
set_output_delay -clock clk  3  [get_ports {m17_out[15]}]
set_output_delay -clock clk  3  [get_ports {m17_out[14]}]
set_output_delay -clock clk  3  [get_ports {m17_out[13]}]
set_output_delay -clock clk  3  [get_ports {m17_out[12]}]
set_output_delay -clock clk  3  [get_ports {m17_out[11]}]
set_output_delay -clock clk  3  [get_ports {m17_out[10]}]
set_output_delay -clock clk  3  [get_ports {m17_out[9]}]
set_output_delay -clock clk  3  [get_ports {m17_out[8]}]
set_output_delay -clock clk  3  [get_ports {m17_out[7]}]
set_output_delay -clock clk  3  [get_ports {m17_out[6]}]
set_output_delay -clock clk  3  [get_ports {m17_out[5]}]
set_output_delay -clock clk  3  [get_ports {m17_out[4]}]
set_output_delay -clock clk  3  [get_ports {m17_out[3]}]
set_output_delay -clock clk  3  [get_ports {m17_out[2]}]
set_output_delay -clock clk  3  [get_ports {m17_out[1]}]
set_output_delay -clock clk  3  [get_ports {m17_out[0]}]
set_output_delay -clock clk  3  [get_ports {m18_out[31]}]
set_output_delay -clock clk  3  [get_ports {m18_out[30]}]
set_output_delay -clock clk  3  [get_ports {m18_out[29]}]
set_output_delay -clock clk  3  [get_ports {m18_out[28]}]
set_output_delay -clock clk  3  [get_ports {m18_out[27]}]
set_output_delay -clock clk  3  [get_ports {m18_out[26]}]
set_output_delay -clock clk  3  [get_ports {m18_out[25]}]
set_output_delay -clock clk  3  [get_ports {m18_out[24]}]
set_output_delay -clock clk  3  [get_ports {m18_out[23]}]
set_output_delay -clock clk  3  [get_ports {m18_out[22]}]
set_output_delay -clock clk  3  [get_ports {m18_out[21]}]
set_output_delay -clock clk  3  [get_ports {m18_out[20]}]
set_output_delay -clock clk  3  [get_ports {m18_out[19]}]
set_output_delay -clock clk  3  [get_ports {m18_out[18]}]
set_output_delay -clock clk  3  [get_ports {m18_out[17]}]
set_output_delay -clock clk  3  [get_ports {m18_out[16]}]
set_output_delay -clock clk  3  [get_ports {m18_out[15]}]
set_output_delay -clock clk  3  [get_ports {m18_out[14]}]
set_output_delay -clock clk  3  [get_ports {m18_out[13]}]
set_output_delay -clock clk  3  [get_ports {m18_out[12]}]
set_output_delay -clock clk  3  [get_ports {m18_out[11]}]
set_output_delay -clock clk  3  [get_ports {m18_out[10]}]
set_output_delay -clock clk  3  [get_ports {m18_out[9]}]
set_output_delay -clock clk  3  [get_ports {m18_out[8]}]
set_output_delay -clock clk  3  [get_ports {m18_out[7]}]
set_output_delay -clock clk  3  [get_ports {m18_out[6]}]
set_output_delay -clock clk  3  [get_ports {m18_out[5]}]
set_output_delay -clock clk  3  [get_ports {m18_out[4]}]
set_output_delay -clock clk  3  [get_ports {m18_out[3]}]
set_output_delay -clock clk  3  [get_ports {m18_out[2]}]
set_output_delay -clock clk  3  [get_ports {m18_out[1]}]
set_output_delay -clock clk  3  [get_ports {m18_out[0]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[63]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[62]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[61]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[60]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[59]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[58]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[57]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[56]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[55]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[54]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[53]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[52]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[51]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[50]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[49]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[48]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[47]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[46]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[45]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[44]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[43]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[42]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[41]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[40]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[39]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[38]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[37]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[36]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[35]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[34]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[33]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[32]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[31]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[30]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[29]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[28]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[27]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[26]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[25]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[24]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[23]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[22]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[21]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[20]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[19]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[18]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[17]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[16]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[15]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[14]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[13]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[12]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[11]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[10]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[9]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[8]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[7]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[6]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[5]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[4]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[3]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[2]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[1]}]
set_output_delay -clock clk  3  [get_ports {srmq_out[0]}]
set_output_delay -clock clk  3  [get_ports {regec_out[31]}]
set_output_delay -clock clk  3  [get_ports {regec_out[30]}]
set_output_delay -clock clk  3  [get_ports {regec_out[29]}]
set_output_delay -clock clk  3  [get_ports {regec_out[28]}]
set_output_delay -clock clk  3  [get_ports {regec_out[27]}]
set_output_delay -clock clk  3  [get_ports {regec_out[26]}]
set_output_delay -clock clk  3  [get_ports {regec_out[25]}]
set_output_delay -clock clk  3  [get_ports {regec_out[24]}]
set_output_delay -clock clk  3  [get_ports {regec_out[23]}]
set_output_delay -clock clk  3  [get_ports {regec_out[22]}]
set_output_delay -clock clk  3  [get_ports {regec_out[21]}]
set_output_delay -clock clk  3  [get_ports {regec_out[20]}]
set_output_delay -clock clk  3  [get_ports {regec_out[19]}]
set_output_delay -clock clk  3  [get_ports {regec_out[18]}]
set_output_delay -clock clk  3  [get_ports {regec_out[17]}]
set_output_delay -clock clk  3  [get_ports {regec_out[16]}]
set_output_delay -clock clk  3  [get_ports {regec_out[15]}]
set_output_delay -clock clk  3  [get_ports {regec_out[14]}]
set_output_delay -clock clk  3  [get_ports {regec_out[13]}]
set_output_delay -clock clk  3  [get_ports {regec_out[12]}]
set_output_delay -clock clk  3  [get_ports {regec_out[11]}]
set_output_delay -clock clk  3  [get_ports {regec_out[10]}]
set_output_delay -clock clk  3  [get_ports {regec_out[9]}]
set_output_delay -clock clk  3  [get_ports {regec_out[8]}]
set_output_delay -clock clk  3  [get_ports {regec_out[7]}]
set_output_delay -clock clk  3  [get_ports {regec_out[6]}]
set_output_delay -clock clk  3  [get_ports {regec_out[5]}]
set_output_delay -clock clk  3  [get_ports {regec_out[4]}]
set_output_delay -clock clk  3  [get_ports {regec_out[3]}]
set_output_delay -clock clk  3  [get_ports {regec_out[2]}]
set_output_delay -clock clk  3  [get_ports {regec_out[1]}]
set_output_delay -clock clk  3  [get_ports {regec_out[0]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[31]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[30]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[29]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[28]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[27]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[26]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[25]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[24]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[23]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[22]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[21]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[20]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[19]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[18]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[17]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[16]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[15]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[14]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[13]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[12]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[11]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[10]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[9]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[8]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[7]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[6]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[5]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[4]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[3]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[2]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[1]}]
set_output_delay -clock clk  3  [get_ports {regeb_out[0]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[31]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[30]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[29]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[28]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[27]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[26]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[25]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[24]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[23]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[22]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[21]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[20]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[19]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[18]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[17]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[16]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[15]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[14]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[13]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[12]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[11]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[10]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[9]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[8]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[7]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[6]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[5]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[4]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[3]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[2]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[1]}]
set_output_delay -clock clk  3  [get_ports {rf_aout[0]}]
set_output_delay -clock clk  3  [get_ports {regi_out[5]}]
set_output_delay -clock clk  3  [get_ports {regi_out[4]}]
set_output_delay -clock clk  3  [get_ports {regi_out[3]}]
set_output_delay -clock clk  3  [get_ports {regi_out[2]}]
set_output_delay -clock clk  3  [get_ports {regi_out[1]}]
set_output_delay -clock clk  3  [get_ports {regi_out[0]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[31]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[30]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[29]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[28]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[27]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[26]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[25]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[24]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[23]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[22]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[21]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[20]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[19]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[18]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[17]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[16]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[15]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[14]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[13]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[12]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[11]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[10]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[9]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[8]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[7]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[6]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[5]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[4]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[3]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[2]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[1]}]
set_output_delay -clock clk  3  [get_ports {regcurrterm_out[0]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[31]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[30]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[29]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[28]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[27]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[26]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[25]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[24]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[23]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[22]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[21]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[20]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[19]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[18]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[17]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[16]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[15]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[14]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[13]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[12]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[11]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[10]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[9]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[8]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[7]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[6]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[5]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[4]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[3]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[2]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[1]}]
set_output_delay -clock clk  3  [get_ports {regsum_out[0]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[31]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[30]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[29]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[28]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[27]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[26]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[25]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[24]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[23]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[22]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[21]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[20]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[19]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[18]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[17]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[16]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[15]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[14]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[13]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[12]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[11]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[10]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[9]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[8]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[7]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[6]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[5]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[4]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[3]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[2]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[1]}]
set_output_delay -clock clk  3  [get_ports {srmt_out[0]}]
set_output_delay -clock clk  3  [get_ports {regms_out[31]}]
set_output_delay -clock clk  3  [get_ports {regms_out[30]}]
set_output_delay -clock clk  3  [get_ports {regms_out[29]}]
set_output_delay -clock clk  3  [get_ports {regms_out[28]}]
set_output_delay -clock clk  3  [get_ports {regms_out[27]}]
set_output_delay -clock clk  3  [get_ports {regms_out[26]}]
set_output_delay -clock clk  3  [get_ports {regms_out[25]}]
set_output_delay -clock clk  3  [get_ports {regms_out[24]}]
set_output_delay -clock clk  3  [get_ports {regms_out[23]}]
set_output_delay -clock clk  3  [get_ports {regms_out[22]}]
set_output_delay -clock clk  3  [get_ports {regms_out[21]}]
set_output_delay -clock clk  3  [get_ports {regms_out[20]}]
set_output_delay -clock clk  3  [get_ports {regms_out[19]}]
set_output_delay -clock clk  3  [get_ports {regms_out[18]}]
set_output_delay -clock clk  3  [get_ports {regms_out[17]}]
set_output_delay -clock clk  3  [get_ports {regms_out[16]}]
set_output_delay -clock clk  3  [get_ports {regms_out[15]}]
set_output_delay -clock clk  3  [get_ports {regms_out[14]}]
set_output_delay -clock clk  3  [get_ports {regms_out[13]}]
set_output_delay -clock clk  3  [get_ports {regms_out[12]}]
set_output_delay -clock clk  3  [get_ports {regms_out[11]}]
set_output_delay -clock clk  3  [get_ports {regms_out[10]}]
set_output_delay -clock clk  3  [get_ports {regms_out[9]}]
set_output_delay -clock clk  3  [get_ports {regms_out[8]}]
set_output_delay -clock clk  3  [get_ports {regms_out[7]}]
set_output_delay -clock clk  3  [get_ports {regms_out[6]}]
set_output_delay -clock clk  3  [get_ports {regms_out[5]}]
set_output_delay -clock clk  3  [get_ports {regms_out[4]}]
set_output_delay -clock clk  3  [get_ports {regms_out[3]}]
set_output_delay -clock clk  3  [get_ports {regms_out[2]}]
set_output_delay -clock clk  3  [get_ports {regms_out[1]}]
set_output_delay -clock clk  3  [get_ports {regms_out[0]}]
set_output_delay -clock clk  3  [get_ports {reges_out[31]}]
set_output_delay -clock clk  3  [get_ports {reges_out[30]}]
set_output_delay -clock clk  3  [get_ports {reges_out[29]}]
set_output_delay -clock clk  3  [get_ports {reges_out[28]}]
set_output_delay -clock clk  3  [get_ports {reges_out[27]}]
set_output_delay -clock clk  3  [get_ports {reges_out[26]}]
set_output_delay -clock clk  3  [get_ports {reges_out[25]}]
set_output_delay -clock clk  3  [get_ports {reges_out[24]}]
set_output_delay -clock clk  3  [get_ports {reges_out[23]}]
set_output_delay -clock clk  3  [get_ports {reges_out[22]}]
set_output_delay -clock clk  3  [get_ports {reges_out[21]}]
set_output_delay -clock clk  3  [get_ports {reges_out[20]}]
set_output_delay -clock clk  3  [get_ports {reges_out[19]}]
set_output_delay -clock clk  3  [get_ports {reges_out[18]}]
set_output_delay -clock clk  3  [get_ports {reges_out[17]}]
set_output_delay -clock clk  3  [get_ports {reges_out[16]}]
set_output_delay -clock clk  3  [get_ports {reges_out[15]}]
set_output_delay -clock clk  3  [get_ports {reges_out[14]}]
set_output_delay -clock clk  3  [get_ports {reges_out[13]}]
set_output_delay -clock clk  3  [get_ports {reges_out[12]}]
set_output_delay -clock clk  3  [get_ports {reges_out[11]}]
set_output_delay -clock clk  3  [get_ports {reges_out[10]}]
set_output_delay -clock clk  3  [get_ports {reges_out[9]}]
set_output_delay -clock clk  3  [get_ports {reges_out[8]}]
set_output_delay -clock clk  3  [get_ports {reges_out[7]}]
set_output_delay -clock clk  3  [get_ports {reges_out[6]}]
set_output_delay -clock clk  3  [get_ports {reges_out[5]}]
set_output_delay -clock clk  3  [get_ports {reges_out[4]}]
set_output_delay -clock clk  3  [get_ports {reges_out[3]}]
set_output_delay -clock clk  3  [get_ports {reges_out[2]}]
set_output_delay -clock clk  3  [get_ports {reges_out[1]}]
set_output_delay -clock clk  3  [get_ports {reges_out[0]}]
set_output_delay -clock clk  3  [get_ports {reget_out[31]}]
set_output_delay -clock clk  3  [get_ports {reget_out[30]}]
set_output_delay -clock clk  3  [get_ports {reget_out[29]}]
set_output_delay -clock clk  3  [get_ports {reget_out[28]}]
set_output_delay -clock clk  3  [get_ports {reget_out[27]}]
set_output_delay -clock clk  3  [get_ports {reget_out[26]}]
set_output_delay -clock clk  3  [get_ports {reget_out[25]}]
set_output_delay -clock clk  3  [get_ports {reget_out[24]}]
set_output_delay -clock clk  3  [get_ports {reget_out[23]}]
set_output_delay -clock clk  3  [get_ports {reget_out[22]}]
set_output_delay -clock clk  3  [get_ports {reget_out[21]}]
set_output_delay -clock clk  3  [get_ports {reget_out[20]}]
set_output_delay -clock clk  3  [get_ports {reget_out[19]}]
set_output_delay -clock clk  3  [get_ports {reget_out[18]}]
set_output_delay -clock clk  3  [get_ports {reget_out[17]}]
set_output_delay -clock clk  3  [get_ports {reget_out[16]}]
set_output_delay -clock clk  3  [get_ports {reget_out[15]}]
set_output_delay -clock clk  3  [get_ports {reget_out[14]}]
set_output_delay -clock clk  3  [get_ports {reget_out[13]}]
set_output_delay -clock clk  3  [get_ports {reget_out[12]}]
set_output_delay -clock clk  3  [get_ports {reget_out[11]}]
set_output_delay -clock clk  3  [get_ports {reget_out[10]}]
set_output_delay -clock clk  3  [get_ports {reget_out[9]}]
set_output_delay -clock clk  3  [get_ports {reget_out[8]}]
set_output_delay -clock clk  3  [get_ports {reget_out[7]}]
set_output_delay -clock clk  3  [get_ports {reget_out[6]}]
set_output_delay -clock clk  3  [get_ports {reget_out[5]}]
set_output_delay -clock clk  3  [get_ports {reget_out[4]}]
set_output_delay -clock clk  3  [get_ports {reget_out[3]}]
set_output_delay -clock clk  3  [get_ports {reget_out[2]}]
set_output_delay -clock clk  3  [get_ports {reget_out[1]}]
set_output_delay -clock clk  3  [get_ports {reget_out[0]}]
set_output_delay -clock clk  3  [get_ports regss0_out]
set_output_delay -clock clk  3  [get_ports {reges0_out[31]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[30]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[29]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[28]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[27]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[26]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[25]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[24]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[23]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[22]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[21]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[20]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[19]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[18]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[17]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[16]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[15]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[14]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[13]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[12]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[11]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[10]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[9]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[8]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[7]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[6]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[5]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[4]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[3]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[2]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[1]}]
set_output_delay -clock clk  3  [get_ports {reges0_out[0]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[63]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[62]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[61]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[60]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[59]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[58]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[57]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[56]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[55]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[54]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[53]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[52]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[51]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[50]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[49]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[48]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[47]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[46]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[45]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[44]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[43]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[42]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[41]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[40]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[39]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[38]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[37]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[36]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[35]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[34]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[33]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[32]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[31]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[30]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[29]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[28]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[27]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[26]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[25]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[24]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[23]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[22]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[21]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[20]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[19]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[18]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[17]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[16]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[15]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[14]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[13]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[12]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[11]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[10]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[9]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[8]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[7]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[6]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[5]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[4]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[3]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[2]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[1]}]
set_output_delay -clock clk  3  [get_ports {ssrms0_out[0]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[31]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[30]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[29]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[28]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[27]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[26]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[25]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[24]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[23]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[22]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[21]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[20]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[19]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[18]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[17]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[16]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[15]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[14]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[13]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[12]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[11]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[10]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[9]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[8]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[7]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[6]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[5]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[4]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[3]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[2]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[1]}]
set_output_delay -clock clk  3  [get_ports {aluone_out[0]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[31]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[30]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[29]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[28]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[27]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[26]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[25]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[24]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[23]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[22]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[21]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[20]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[19]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[18]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[17]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[16]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[15]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[14]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[13]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[12]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[11]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[10]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[9]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[8]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[7]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[6]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[5]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[4]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[3]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[2]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[1]}]
set_output_delay -clock clk  3  [get_ports {regreg_out[0]}]
set_output_delay -clock clk  3  [get_ports {rege_out[31]}]
set_output_delay -clock clk  3  [get_ports {rege_out[30]}]
set_output_delay -clock clk  3  [get_ports {rege_out[29]}]
set_output_delay -clock clk  3  [get_ports {rege_out[28]}]
set_output_delay -clock clk  3  [get_ports {rege_out[27]}]
set_output_delay -clock clk  3  [get_ports {rege_out[26]}]
set_output_delay -clock clk  3  [get_ports {rege_out[25]}]
set_output_delay -clock clk  3  [get_ports {rege_out[24]}]
set_output_delay -clock clk  3  [get_ports {rege_out[23]}]
set_output_delay -clock clk  3  [get_ports {rege_out[22]}]
set_output_delay -clock clk  3  [get_ports {rege_out[21]}]
set_output_delay -clock clk  3  [get_ports {rege_out[20]}]
set_output_delay -clock clk  3  [get_ports {rege_out[19]}]
set_output_delay -clock clk  3  [get_ports {rege_out[18]}]
set_output_delay -clock clk  3  [get_ports {rege_out[17]}]
set_output_delay -clock clk  3  [get_ports {rege_out[16]}]
set_output_delay -clock clk  3  [get_ports {rege_out[15]}]
set_output_delay -clock clk  3  [get_ports {rege_out[14]}]
set_output_delay -clock clk  3  [get_ports {rege_out[13]}]
set_output_delay -clock clk  3  [get_ports {rege_out[12]}]
set_output_delay -clock clk  3  [get_ports {rege_out[11]}]
set_output_delay -clock clk  3  [get_ports {rege_out[10]}]
set_output_delay -clock clk  3  [get_ports {rege_out[9]}]
set_output_delay -clock clk  3  [get_ports {rege_out[8]}]
set_output_delay -clock clk  3  [get_ports {rege_out[7]}]
set_output_delay -clock clk  3  [get_ports {rege_out[6]}]
set_output_delay -clock clk  3  [get_ports {rege_out[5]}]
set_output_delay -clock clk  3  [get_ports {rege_out[4]}]
set_output_delay -clock clk  3  [get_ports {rege_out[3]}]
set_output_delay -clock clk  3  [get_ports {rege_out[2]}]
set_output_delay -clock clk  3  [get_ports {rege_out[1]}]
set_output_delay -clock clk  3  [get_ports {rege_out[0]}]
